app/Services/DetailService.php

    public function getAll()
    {
        return Detail::paginate(12);
---
select * from `detail` limit 12 offset 0
select count(*) as aggregate from `detail`

    public function getByFilters(array $categories)
    {
        $brands = QueryBuilder::for(Firm::class)->allowedFilters(AllowedFilter::exact('id', 'fr_code'))->get();

        return Detail::whereIn('dt_typec', $categories)->whereIn('fr_code', $brands->pluck('fr_name')->toArray())->paginate(12)->withQueryString();
---
select * from `detail` where `dt_typec` in ('ГЕНЕРАТОР') and `fr_code` in ('AMD', 'ASAM', 'AS-PL', 'AUTONICA', 'AVP', 'BOSCH', 'CARGO', 'CHRYSLER', 'CRAFТ', 'Defu', 'DELCO', 'Delta', 'DENSO', 'DIXIE', 'ECS', 'EKSIN', 'ELDIX', 'ELMOT', 'ELSTOCK', 'ERA', 'FAG', 'FEMSA', 'Ford', 'FOTON', 'GEBE', 'GEELY', 'GENON', 'GHIBAUDI', 'GM', 'Great wall', 'HC-CARGO', 'HC-PARTS', 'HITACHI', 'HUCO', 'Hyundai', 'IKA', 'INA', 'ISKRA', 'JUBANA', 'KIA', 'KOYO', 'KRAUF', 'LAUBER', 'LITENS', 'LUCAS', 'MAGNETON', 'MAHLE', 'MANDO', 'MARELLI', 'MAZDA', 'Mercedes', 'MESSMER', 'MFG', 'MITSUBA', 'MITSUBISHI', 'MOBILETRON', 'MOTORHERZ', 'MOTORKRAFT', 'MOTOROLA', 'NIERMANN', 'NISSAN', 'NISSENS', 'NSK', 'NTN', 'Onnuri', 'OPEL', 'OREM', 'ORME', 'PAL', 'PAM', 'PATRON', 'Prestolite', 'PROTECH', 'PSH', 'QAP', 'RCP', 'REAL', 'Renault', 'RG', 'RNL', 'Ruville', 'Seinsa', 'SIOM', 'SKF', 'SNR', 'STEMOT', 'TESLA TECHNICS', 'TOYOTA', 'TRANSPO', 'UNIPOINT', 'UTM', 'VAG', 'VALEO', 'VAZ', 'Vis nova', 'VOLTAGE', 'WAI', 'WAI(Китай)', 'WATO', 'WBD', 'WOODAUTO', 'WPS', 'WURTH', 'ZETDEZET', 'ZM', 'ZNP', 'АТЭ', 'БАТЭ', 'Восстановл.', 'КЗАТЭ', 'Китай', 'ОРБИТА', 'ПРАМО', 'Экзист', 'Эксин', 'ЭЛТРА', 'BOSCH', 'MAHLE', 'БАТЭ', 'LAUBER', 'TESLA TECHNICS', 'BG', 'ZETDEZET', 'NISSENS', 'GAUSS', 'PSH', 'ПРАМО', 'КЗАТЭ', 'SNR', 'ELSTOCK', 'METRO', 'PATRON', 'GEELY', 'JUBANA', 'FOTON', 'ЭЛТРА', 'АТЭ', 'WURTH', 'CRAFТ', '.', 'ОРБИТА', 'MOTORHERZ', 'BOSCH', 'BOSCH', 'BOSCH', 'BOSCH') limit 12 offset 0
select count(*) as aggregate from `detail` where `dt_typec` in ('ГЕНЕРАТОР') and `fr_code` in ('AMD', 'ASAM', 'AS-PL', 'AUTONICA', 'AVP', 'BOSCH', 'CARGO', 'CHRYSLER', 'CRAFТ', 'Defu', 'DELCO', 'Delta', 'DENSO', 'DIXIE', 'ECS', 'EKSIN', 'ELDIX', 'ELMOT', 'ELSTOCK', 'ERA', 'FAG', 'FEMSA', 'Ford', 'FOTON', 'GEBE', 'GEELY', 'GENON', 'GHIBAUDI', 'GM', 'Great wall', 'HC-CARGO', 'HC-PARTS', 'HITACHI', 'HUCO', 'Hyundai', 'IKA', 'INA', 'ISKRA', 'JUBANA', 'KIA', 'KOYO', 'KRAUF', 'LAUBER', 'LITENS', 'LUCAS', 'MAGNETON', 'MAHLE', 'MANDO', 'MARELLI', 'MAZDA', 'Mercedes', 'MESSMER', 'MFG', 'MITSUBA', 'MITSUBISHI', 'MOBILETRON', 'MOTORHERZ', 'MOTORKRAFT', 'MOTOROLA', 'NIERMANN', 'NISSAN', 'NISSENS', 'NSK', 'NTN', 'Onnuri', 'OPEL', 'OREM', 'ORME', 'PAL', 'PAM', 'PATRON', 'Prestolite', 'PROTECH', 'PSH', 'QAP', 'RCP', 'REAL', 'Renault', 'RG', 'RNL', 'Ruville', 'Seinsa', 'SIOM', 'SKF', 'SNR', 'STEMOT', 'TESLA TECHNICS', 'TOYOTA', 'TRANSPO', 'UNIPOINT', 'UTM', 'VAG', 'VALEO', 'VAZ', 'Vis nova', 'VOLTAGE', 'WAI', 'WAI(Китай)', 'WATO', 'WBD', 'WOODAUTO', 'WPS', 'WURTH', 'ZETDEZET', 'ZM', 'ZNP', 'АТЭ', 'БАТЭ', 'Восстановл.', 'КЗАТЭ', 'Китай', 'ОРБИТА', 'ПРАМО', 'Экзист', 'Эксин', 'ЭЛТРА', 'BOSCH', 'MAHLE', 'БАТЭ', 'LAUBER', 'TESLA TECHNICS', 'BG', 'ZETDEZET', 'NISSENS', 'GAUSS', 'PSH', 'ПРАМО', 'КЗАТЭ', 'SNR', 'ELSTOCK', 'METRO', 'PATRON', 'GEELY', 'JUBANA', 'FOTON', 'ЭЛТРА', 'АТЭ', 'WURTH', 'CRAFТ', '.', 'ОРБИТА', 'MOTORHERZ', 'BOSCH', 'BOSCH', 'BOSCH', 'BOSCH')

    public function getBySearching(string $searchQuery)
    {
        $detailsFromOems = Oems::search($searchQuery)->get();
        $ids = array_merge($detailsFromOems->pluck('dt_oem')->toArray(), $detailsFromOems->pluck('dt_invoice')->toArray());
        $tmpArr = array_unique($ids);
        $i = 0;
        while ($tmpArr != []) {
            $oems = Oems::whereIn('dt_invoice', $tmpArr)->orWhereIn('dt_oem', $tmpArr)->get();
            $tmpArr = array_unique(array_merge($oems->pluck('dt_oem')->toArray(), $oems->pluck('dt_invoice')->toArray()));
            $tmpArr = array_diff($tmpArr, $ids);
            $ids = array_unique(array_merge($ids, $tmpArr));
            $i++;
        }
        $details = Detail::whereIn('dt_invoice', $ids)->orWhereIn('dt_cargo', $ids)->orWhereIn('dt_oem', $ids)->select('dt_invoice', 'dt_oem', 'dt_typec', 'fr_code', 'dt_foto')->get();
        foreach ($ids as $id) {
            $item = Detail::where('dt_comment', 'like', "%$id%")->select('dt_invoice', 'dt_oem', 'dt_typec', 'fr_code', 'dt_foto')->get();
            Log::info($item);
            if (! $item->isEmpty()){ //&& array_search($item->pluck('dt_invoice'), $ids)) {
---
select `dt_invoice`, `dt_oem`, `dt_typec`, `fr_code` from `detail` where `dt_invoice` in ('AHV0072', 'SVX72', 'SVX7', '38-9402', '38-402', '38-401', '300821', 'SVX12', '92967', '300796', '2521679E', 'SVX9', 'SVX92', 'SVX52', '35MC0490', 'IA3595', 'SSVX-7-9', 'SSVX-7', 'SSVX-10', '0.1781.1', '1917012400', '1917012401', '092859', '092967', 'IA3740') or `dt_cargo` in ('AHV0072', 'SVX72', 'SVX7', '38-9402', '38-402', '38-401', '300821', 'SVX12', '92967', '300796', '2521679E', 'SVX9', 'SVX92', 'SVX52', '35MC0490', 'IA3595', 'SSVX-7-9', 'SSVX-7', 'SSVX-10', '0.1781.1', '1917012400', '1917012401', '092859', '092967', 'IA3740') or `dt_oem` in ('AHV0072', 'SVX72', 'SVX7', '38-9402', '38-402', '38-401', '300821', 'SVX12', '92967', '300796', '2521679E', 'SVX9', 'SVX92', 'SVX52', '35MC0490', 'IA3595', 'SSVX-7-9', 'SSVX-7', 'SSVX-10', '0.1781.1', '1917012400', '1917012401', '092859', '092967', 'IA3740') and `dt_comment` like 'AHV0072'
select * from `oems` where `dt_invoice` in ('AHV1602', '35MC0467', 'PX602', 'PX60', '300722', '92950', '16.970.206', '16.770.206', 'IA3594', '0.1719.1') or `dt_oem` in ('AHV1602', '35MC0467', 'PX602', 'PX60', '300722', '92950', '16.970.206', '16.770.206', 'IA3594', '0.1719.1')
select `dt_invoice`, `dt_oem`, `dt_typec`, `fr_code`, `dt_foto` from `detail` where `dt_invoice` in ('AHV1602', '35MC0467', 'PX602', 'PX60', '300722', '92950', '16.970.206', '16.770.206', 'IA3594', '0.1719.1', '16770206', '16970206', '092950') or `dt_cargo` in ('AHV1602', '35MC0467', 'PX602', 'PX60', '300722', '92950', '16.970.206', '16.770.206', 'IA3594', '0.1719.1', '16770206', '16970206', '092950') or `dt_oem` in ('AHV1602', '35MC0467', 'PX602', 'PX60', '300722', '92950', '16.970.206', '16.770.206', 'IA3594', '0.1719.1', '16770206', '16970206', '092950')
select `dt_invoice`, `dt_oem`, `dt_typec`, `fr_code`, `dt_foto` from `detail` where `dt_comment` like '%AHV1602%'

    public function getByInvoice(string $invoice)
    {
        return Detail::where('dt_invoice', '=', $invoice)->get();
---
select * from `detail` where `dt_invoice` = 'S2092S'