app/Http/Middleware/HandleInertiaRequests.php

select * from `firm`
---
    public function share(Request $request): array
    {
        return [
            ...parent::share($request),
            'auth' => [
                'user' => $request->user(),
            ],
            'categories' => [
                'brands' => [Firm::all()],
            ],