<?php

return [
    'filters' => [
        'bearing' => ['ПОДШИПНИК', 'ПОДШИПНИК КОМПРЕССОРА КОНДИЦИОНЕРА'],
        'generator' => ['ГЕНЕРАТОР'],
        'starter' => ['СТАРТЕР'],

        'other_details' => [
            'АВТОХИМИЯ', 'ВИНТ', 'ВЕНТИЛЯТОР САЛОНА', 'ВТУЛКА СФЕРИЧЕСКАЯ',
            'ИЗОЛЯТОР', 'ИНСТРУМЕНТ', 'КРЫШКА ПОДШИПНИКА', 'МУФТА РЕЗИНОВАЯ',
            'ОБОРУДОВАНИЕ И ОСНАСТКА', 'ПРИПОЙ ДЛЯ КОНТАКТНОЙ СВАРКИ',
            'РЕМКОМПЛЕКТ', 'СМАЗКА ДЛЯ БЕНДИКСОВ MOLYKOTE 33', 'СТОПОР',
            'СТОПОРНАЯ ПЛАСТИНА ПОДШИПНИКА', 'СТОПОРНОЕ КОЛЬЦО',
            'СТОПОРНОЕ КОЛЬЦО КОМПЛЕКТ', 'ШАЙБА', 'ШАЙБА ДИСТАНЦИОННАЯ', 'ШПОНКА',
        ],

        'generator_parts' => [
            'sleeve'    => ['ВТУЛКА ГЕНЕРАТОРА', 'ВТУЛКА ПОДШИПНИКА'],
            'pump'      => ['ВАКУУМНЫЙ НАСОС ГЕНЕРАТОРА', 'ЛОПАСТИ ВАКУУМНОГО НАСОСА'],
            'rectifier' => ['ВЫПРЯМИТЕЛЬ ГЕНЕРАТОРА', 'ВЫПРЯМИТЕЛЬ + КРЫШКА ГЕНЕРАТОРА', 'ВЫПРЯМИТЕЛЬ + РЕГУЛЯТОР ГЕНЕРАТОРА'],
            'diode'     => ['ДИОД', 'ТРИОД ГЕНЕРАТОРА'],
            'insulator' => ['ИЗОЛЯТОР ГЕНЕРАТОРА'],
            'cover'     => ['КРЫШКА ГЕНЕРАТОРА', 'КРЫШКА ГЕНЕРАТОРА ЗАДНЯЯ', 'КРЫШКА ГЕНЕРАТОРА ПЕРЕДНЯЯ', 'КРЫШКА ГЕНЕРАТОРА ЗАЩИТНАЯ'],
            'regulator' => ['РЕГУЛЯТОР НАПРЯЖЕНИЯ ГЕНЕРАТОРА'],
            'rotor'     => ['РОТОР ГЕНЕРАТОРА', 'КОЛЛЕКТОР РОТОРА ГЕНЕРАТОРА'],
            'terminal'  => ['ТЕРМИНАЛ'],
            'gland'     => ['САЛЬНИК ГЕНЕРАТОРА'],
            'winding'   => ['СТАТОРНАЯ ОБМОТКА ГЕНЕРАТОРА'],
            'pulley'    => ['ШКИВ ГЕНЕРАТОРА', 'ШКИВ ГЕНЕРАТОРА ОБГОННЫЙ', 'КРЫШКА ШКИВА', 'ПРИВОДНОЙ РЕМЕНЬ ШКИВА'],
            'brush'     => ['ЩЁТКИ ГЕНЕРАТОРА'],
            'holder'    => ['ЩЁТОЧНЫЙ УЗЕЛ ГЕНЕРАТОРА'],
        ],

        'starter_parts' => [
            'fork'        => ['ВИЛКА СТАРТЕРА'],
            'sleeve'      => ['ВТУЛКА СТАРТЕРА', 'ВТУЛКА СТАРТЕРА КОМПЛЕКТ', 'НАБОР ВТУЛОК СТАРТЕРА'],
            'relay'       => ['ВТЯГИВАЮЩЕЕ РЕЛЕ СТАРТЕРА'],
            'relay_parts' => ['СЕРДЕЧНИК'],
            'unit_parts'  => ['ШЕСТЕРНЯ ПРИВОДА СТАРТЕРА'],
            'cover'       => ['КРЫШКА СТАРТЕРА'],
            'unit'        => ['ПРИВОД СТАРТЕРА', 'РОЛИК ПРИВОДА СТАРТЕРА', 'ШТОК ПРИВОДА СТАРТЕРА'],
            'other'       => ['ДЕРЖАТЕЛЬ ВИЛКИ', 'РЕДУКТОР+ПРИВОД', 'КОНТАКТ(ШИНА) СТАРТЕРА', 'ЗАЩИТНЫЙ КОЛПАЧЁК СТАРТЕРА', 'ВИНТ СТАРТЕРА', 'ПРОВОД СТАРТЕРА', 'МУФТА СТАРТЕРА'],
            'reducer'     => ['ВАЛ РЕДУКТОРА СТАРТЕРА', 'ПЛАНЕТАРНЫЙ РЕДУКТОР', 'РЕДУКТОР СТАРТЕРА', 'КРЫШКА РЕДУКТОРА', 'КОРПУС РЕДУКТОРА'],
            'repair'      => ['РЕМКОМПЛЕКТ СТАРТЕРА'],
            'glands'      => ['САЛЬНИК СТАРТЕРА'],
            'stator'      => ['СТАТОР', 'КОРПУС СТАТОРА', 'СТАТОР В СБОРЕ С КРЫШКОЙ', 'СТАТОРНАЯ ОБМОТКА СТАРТЕРА'],
            'brush'       => ['ЩЁТКИ СТАРТЕРА'],
            'holder'      => ['ЩЁТОЧНЫЙ УЗЕЛ СТАРТЕРА'],
            'anchor'      => ['ЯКОРЬ СТАРТЕРА', 'КРЫШКА ЯКОРЯ'],
        ]
    ]
];
