app/Providers/AppServiceProvider.php

select * from `firm`
---
    public function boot(): void
    {
        Inertia::composer('Catalog/Index', function (ResponseFactory $inertia) {
            $inertia->with([
                'categories' => [
                    'brands' => Firm::all(),
                ],
            ]);
        });